Oracle Data Integrator (ODI)/fusion-bicc-trigger-webservice-response.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
              xmlns:ns1="http://www.w3.org/2005/08/addressing"
              xmlns:ns2="http://xmlns.oracle.com/scheduler"
              xmlns:ns3="http://xmlns.oracle.com/scheduler/types">
	<env:Header>
		<ns1:MessageID>uuid:68dba315-62d0-4b7d-ba5c-46b670155111</ns1:MessageID>
		<ns1:Action>submitRequest</ns1:Action>
		<ns1:To>https://sample.fa.em3.oraclecloud.com:443/bi/ess/esswebservice</ns1:To>
	</env:Header>
	<env:Body>
		<ns2:submitRequest>
			<ns2:description/>
			<ns2:jobDefinitionId>
				<ns3:name>BICloudConnectorJobDefinition</ns3:name>
				<ns3:packageName>oracle.apps.ess.biccc</ns3:packageName>
				<ns3:type>JOB_DEFINITION</ns3:type>
			</ns2:jobDefinitionId>
			<ns2:application>oracle.biacm</ns2:application>
			<ns2:requestedStartTime>2020-10-02T09:44:01Z</ns2:requestedStartTime>
			<ns2:requestParameters>
				<ns3:parameter>
					<ns3:dataType>STRING</ns3:dataType>
					<ns3:name>SYS_className</ns3:name>
					<ns3:value>oracle.esshost.impl.CloudAdaptorJobImpl</ns3:value>
				</ns3:parameter>
				<ns3:parameter>
					<ns3:dataType>STRING</ns3:dataType>
					<ns3:name>SYS_requestCategory</ns3:name>
					<ns3:value>JobSchedule</ns3:value>
				</ns3:parameter>
				<ns3:parameter>
					<ns3:dataType>STRING</ns3:dataType>
					<ns3:name>SYS_application</ns3:name>
					<ns3:value>BI Cloud Adaptor</ns3:value>
				</ns3:parameter>
				<ns3:parameter>
					<ns3:dataType>STRING</ns3:dataType>
					<ns3:name>EXTRACT_JOB_TYPE</ns3:name>
					<ns3:value>VO_EXTRACT</ns3:value>
				</ns3:parameter>
				<ns3:parameter>
					<ns3:dataType>LONG</ns3:dataType>
					<ns3:name>JOB_ID</ns3:name>
					<ns3:value>#GLOBAL.V_BICCC_JOB_ID</ns3:value>
				</ns3:parameter>
				<ns3:parameter>
					<ns3:dataType>STRING</ns3:dataType>
					<ns3:name>EXTERNAL_STORAGE_LIST</ns3:name>
					<ns3:value>#GLOBAL.V_BICC_EXPORT_BUCKET_NAME</ns3:value>
				</ns3:parameter>
			</ns2:requestParameters>
		</ns2:submitRequest>
	</env:Body>
</env:Envelope>