bicc/bicc_job_status.xml

<soapenv:Envelope xmlns:sch="http://xmlns.oracle.com/scheduler" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-2EDFD1B89B8B325BFE16478839479747">
            <wsse:Username>ORA_FA_USER</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">ORA_FA_PWD</wsse:Password>
         </wsse:UsernameToken>
         <wsu:Timestamp wsu:Id="TS-2EDFD1B89B8B325BFE16478839182089">
            <wsu:Created>ORA_FA_START_DATE_TIME</wsu:Created>
            <wsu:Expires>ORA_FA_END_DATE_TIME</wsu:Expires>
         </wsu:Timestamp>
      </wsse:Security>
      <wsa:MessageID>ORA_FA_MESSAGE_ID</wsa:MessageID>
      <wsa:Action>getRequestState</wsa:Action>
   </soapenv:Header>
   <soapenv:Body>
      <sch:getRequestState>
         <sch:requestId>ORA_FA_BICC_REQUEST</sch:requestId>
      </sch:getRequestState>
   </soapenv:Body>
</soapenv:Envelope>